{
  "navbar": {
    "home": "Home",
    "aboutMe": "About me",
    "projects": "My projects",
    "contact": "Contact",
    "languages": "Languages"
  },
  "index": {
    "subHeader": "Computer Engineer, Web Developer and Programmer"
  },
  "about": {
    "header": "About <span class='text-secondary'>me</span>",
    "introductionLink": "Introduction",
    "technologiesLink": "Technologies",
    "experienceLink": "Experience",
    "coursesLink": "Courses / Certifications",
    "technologiesTitle": "Technologies and skills",
    "allTechnologiesCategory": "All",
    "frontendTechnologiesCategory": "Frontend",
    "backendTechnologiesCategory": "Backend",
    "languagesTechnologiesCategory": "Languages",
    "toolsTechnologiesCategory": "Tools",
    "experienceTitle": "Experience and education",
    "resumeDownloadLink": "You can download my resume  <a target='_blank'  noreferrer noopener  href='/files/CesarBlascoResume.pdf'>here</a>",
    "timelineCategoryLine": "Timeline",
    "timelineCategoryStacked": "Stacked cards",
    "coursesTitle": "Courses / certifications",
    "rankmiPosition": "Frontend Developer (June 2018 - Ongoing)",
    "rankmiBullet1": "Developed components, modules and features of diverse complexities using Angular JS framework version 1.6.7.",
    "rankmiBullet2": "Refactored components from .js to .ts and made improvements over legacy code.",
    "rankmiBullet3": "Collaborated in creating and refactoring components to enable accessibility by limited or impaired users (WAI ARIA standards for the web). This portfolio website is fully accesible.",
    "rankmiBullet4": "Learned React JS and collaborated in the migration of the application from Angular JS to React JS.",
    "sotecPosition": "Fullstack Developer (June 2017 - June 2018)",
    "sotecBullet1": "Developed components, modules and features using the Angular framework versions 2 to 5.",
    "sotecBullet2": "Involved in proyects that used the SCRUM methodology for agile development.",
    "sotecBullet3": "Collaborated in REST API development using Spring Framework and Entity Framework with Microsoft SQL Server",
    "dentalClinicPosition": "Fullstack Developer (June 2017 - August 2018)",
    "dentalClinicBullet1": "My first big web application that served all the needs of a dental clinic and the beginning of my journey into web development as this was my thesis project.",
    "dentalClinicBullet2": "Even though it isn't really work related experience, it was an app developed for real world use and I consider it a worthy mention in my overall experience as a web developer.",
    "dentalClinicBullet3": "Featuring the following modules: appointments, specialist and procedures management, patient's CRUD, patient's history, interactive patient teeth interface, reports (PDF, Excel) and payments.",
    "dentalClinicBullet4": "The interface that displays the patient's teeth allows the user to display certain figures and color each section of each tooth individually as well.",
    "dentalClinicBullet5": "Tools used: Jquery, Laravel Framework, Bootstrap 3, SVG, Raphael JS, MySQL.",
    "defaultSpeechBubbleText1": "Hello! My name is César Blasco, I'm a software engineer that cares about good practices and clean code.  My main focus is the frontend and I am currently an Angular developer transitioning to React. I've also done some backend in Java and PHP with frameworks.",
    "defaultSpeechBubbleText2": "I consider myself a team player, always willing to help others whenever I can. I've mentored and have been mentored by others with higher seniority, something I find very fullfulling.",
    "defaultSpeechBubbleText3": "When building software I'm analitic, methodic and I design the architecture to give the best solution possible.",
    "defaultSpeechBubbleText4": "<div class='text-center'>Some of my favorite hoobies are:</div> <ul class='centered-unordered-list'><li><i class='fas fa-tv'></i> Watching movies and series <i class='fas fa-tv'></i></li><li><i class='fas fa-laptop-code'></i> Programming <i class='fas fa-laptop-code'></i></li> <li><i class='fas fa-gamepad'></i> Videogames <i class='fas fa-gamepad'></i></li> <li><i class='fas fa-music'></i> Listening to music <i class='fas fa-music'></i></li> <li><i class='fas fa-walking'></i> Taking long walks <i class='fas fa-walking'></i></li><ul>",
    "htmlSpeechBubbleText1": "The skeleton of the Web",
    "cssSpeechBubbleText1": "The skin of the web, the layer where the beauty of the websites come from. I've worked with regular CSS, frameworks and preprocessors. Flexbox is currently my favorite layout design pattern. I've also tried some CSS grid. This website is mostly flexbox and a bit of Grid",
    "jsSpeechBubbleText1": "Javascript has gotten better over time, currently I use ES6+ features which have allowed me efficient and readable code. <br> I've shipped code to production environments using deestructuring, arrow functions, const, let, map, filter and many more.",
    "reactSpeechBubbleText1": "I've been transitioning to React since the company where I work decided to migrate to React instead of Angular and so far I've loved it. It's easy to understand such a small but powerful library. I definitely like HTML in JS (JSX) instead of the other way around, it's much more flexible and powerful, and any little typo you make in your markup will be detected."
  },
  "projects": {
    "header": "My <span class='text-secondary'>projects</span>",
    "subHeader": "Check out my projects",
    "allProjectsCategory": "All",
    "webProjectsCategory": "Web",
    "mobileAppsCategory": "Mobile Apps",
    "gamesProjectsCategory": "Games",
    "otherProjectsCategory": "Others",
    "infoBtn": "Info",
    "githubBtn": "Github",
    "codepenBtn": "Codepen"
  },
  "contact": {
    "header": "Contact <span class='text-secondary'>me</span>",
    "subHeader": "This is how you can reach me"
  }
}
