{
  "head": {
    "homeTitle": "Welcome to my portfolio",
    "aboutTitle": "About me",
    "projectsTitle": "My projects",
    "contactTitle": "Contact me"
  },
  "navbar": {
    "home": "Home",
    "aboutMe": "About me",
    "projects": "My projects",
    "contact": "Contact",
    "languages": "EN"
  },
  "index": {
    "subHeader": "Computer Engineer, Web Developer and Programmer"
  },
  "about": {
    "header": "About <span class='text-secondary'>me</span>",
    "technologiesLink": "Skills",
    "experienceLink": "Experience",
    "educationLink": "Education",
    "coursesLink": "Certifications",
    "technologiesTitle": "<i class='fas fa-cog'></i> Skills <i class='fas fa-cog'></i>",
    "allTechnologiesCategory": "All",
    "frontendTechnologiesCategory": "Frontend",
    "backendTechnologiesCategory": "Backend",
    "languagesTechnologiesCategory": "Languages",
    "toolsTechnologiesCategory": "Tools",
    "experienceTitle": "<i class='fa fa-book'></i> <i class='fas fa-book-open'></i> Experience <i class='fas fa-book-open'></i> <i class='fa fa-book'></i>",
    "educationTitle": "<i class='fas fa-graduation-cap'></i> Education <i class='fas fa-graduation-cap'></i>",
    "resumeDownloadLink": "You can download my resume  <a target='_blank'  rel='noreferrer noopener'  href='./files/CesarBlascoResume.pdf'>here</a>",
    "coursesTitle": "<i class='fas fa-chalkboard-teacher'></i> Certifications <i class='fas fa-chalkboard-teacher'></i>",
    "educationPosition": "Bachelor's Degree in Computer Engineering",
    "educationBullet1": "Got my bachelor's degree in Computer Engineering",
    "educationBullet2": "Learned about many topics of computer science and engineering like Data Structures, Algorithms, Object Oriented Programming, etc",
    "rankmiPosition": "Frontend Developer (June 2018 - Ongoing)",
    "rankmiBullet1": "Developed components, modules and features from the most trivial, up the most complex using Angular JS framework version 1.6.7.",
    "rankmiBullet2": "Refactored components from .js to .ts and made improvements over legacy code.",
    "rankmiBullet3": "Collaborated in creating and refactoring components to enable accessibility by limited or impaired users (WAI ARIA standards for the web). This portfolio website is fully accesible.",
    "rankmiBullet4": "Learned React JS and collaborated in the migration of the application from Angular JS to React JS.",
    "sotecPosition": "Fullstack Developer (June 2017 - June 2018)",
    "sotecBullet1": "Developed components, modules and features using the Angular framework versions 2 to 5.",
    "sotecBullet2": "Collaborated in REST API development using Spring Framework and Entity Framework with Microsoft SQL Server",
    "sotecBullet3": "Involved in proyects that used the SCRUM methodology for agile development.",
    "dentalClinicPosition": "Fullstack Developer (June 2017 - August 2018)",
    "dentalClinicBullet1": "This was my thesis project and my first big web application that served all the needs of a dental clinic and the beginning of my journey into web development as this was my thesis project.",
    "dentalClinicBullet2": "Even though it isn't really work related experience, it was an app developed for real world use and I consider it a worthy mention in my overall experience as a web developer.",
    "dentalClinicBullet3": "Featuring the following modules: appointments, specialist and procedures management, patient's CRUD, patient's history, interactive patient teeth interface, reports (PDF, Excel) and payments.",
    "dentalClinicBullet4": "The interface that displays the patient's teeth allows the user to display certain figures and color each section of each tooth individually as well.",
    "dentalClinicBullet5": "Tools used: Jquery, Laravel Framework, Bootstrap 3, SVG, Raphael JS, MySQL.",
    "defaultSpeechBubbleText1": "Hello! My name is César Blasco, I'm a software engineer that cares about good practices and clean code.  My main focus right now  is the frontend and I'm an Angular and React developer. I've also done some backend in Java and PHP with frameworks.",
    "defaultSpeechBubbleText2": "I consider myself a team player, always willing to help others whenever I can. I've mentored and have been mentored by others with higher seniority, something I find very fullfulling.",
    "defaultSpeechBubbleText3": "When building software I'm analitic, methodic and I design the architecture to give the best solution possible.",
    "defaultSpeechBubbleText4": "<div class='text-center'>Some of my favorite hobbies are:</div> <ul class='centered-unordered-list'><li><i class='fas fa-tv'></i> Watching movies and series <i class='fas fa-tv'></i></li><li><i class='fas fa-laptop-code'></i> Programming <i class='fas fa-laptop-code'></i></li> <li><i class='fas fa-gamepad'></i> Videogames <i class='fas fa-gamepad'></i></li> <li><i class='fas fa-music'></i> Listening to music <i class='fas fa-music'></i></li> <li><i class='fas fa-walking'></i> Taking long walks <i class='fas fa-walking'></i></li><ul>",
    "htmlSpeechBubbleText1": "The skeleton of the web, defines the basic structure of the websites. Nowdays you write HMTL depending on the framework / library being used. Be it html in JS (JSX / React), JS in HTML (directives / Angular). Accesibility and semantic HTML are also important concepts.",
    "cssSpeechBubbleText1": "The skin of the web, the layer where the beauty of the websites come from. I've worked with native CSS, frameworks and preprocessors. Flexbox is currently my favorite layout design pattern. I've also tried some CSS grid. This website is mostly flexbox and a bit of Grid",
    "jsSpeechBubbleText1": "Javascript has gotten better over time, currently I use ES6+ features which have allowed me to write efficient and more readable code. <br> I've shipped code to production environments using deestructuring, arrow functions, const, let, map, filter and many more.",
    "jsSpeechBubbleText2": "You can see some samples too in the source code of this portfolio. Also, I didn't use a framework to develop this project, I thought it was overkill, so you'll only find vanilla JS.",
    "reactSpeechBubbleText1": "Ever since I tried React I've loved it, so much in fact that I decided to fully commit to this library. The API is small but very powerfull. Combine it with JSX and TS (TSX, which I've worked with since I started learning the library) and any little typo you make in your markup will be detected. It's way safer.",
    "jquerySpeechBubbleText1": "One of the first javascript libraries I learned. Even though nowdays the web development world is shifting away from this library, I found it easy to understand and learn even more about DOM manipulation with it.",
    "phpSpeechBubbleText1": "I learned PHP by myself when I was in college and then I learned learning the Laravel framework (a PHP framework) in which I developed my dental clinic app. I haven't developed in PHP for a good while now as I'm sticking to JS libraries and frameworks but I still got the knowledge.",
    "vsCodeSpeechBubbleText1": "My favorite code editor. It's so simple yet powerful, an infinite amount of plugins and a huge community backing it up. I actually started with Sublime Text when I started learning web development, but now I can't go back :)",
    "vsCodeSpeechBubbleText2": "Some of my favorite plugins include: Live Server, Live Sass Compiler, Prettier, Bracket Pair Colorizer, Git Lens and a few others.",
    "angularSpeechBubbleText1": "Angular was the first frontend framework I learned. I completed some courses, trained myself and got my first job using this powerful framework. It was hard at first, since there's so many concepts, but once you get the hang of it you realize you can develop anything with it and it's all in the box ready for you.",
    "angularjsSpeechBubbleText1": "I learned Angular JS when I switched jobs. The transition wasn't as hard as I thought it would be since the version that the company used was the 1.6.7 that uses the component model for development, very similar to Angular 2+.",
    "laravelSpeechBubbleText1": "The first web framework I learned and used. I was in college when I heard of this framework and decided to give it a shot. It's very nice and it's so easy to develop apps with it. I developed my dental clinic application using this framework and it turned out pretty good.",
    "gitSpeechBubbleText1": "<span class=\"console-user\">blasco@cesar-pc:</span> <span class=\"console-directory\">~/i18n/en</span> <br> $ git commit -m \"About git\" -m \"Update speech bubble with information about the best version control system, add key to JSON\" <br><br> <span class=\"console-user\">blasco@cesar-pc:</span> <span class=\"console-directory\">~/i18n/en</span> <br> $ git push",
    "gitSpeechBubbleText2": "I've used git in both console and GUI clients like SmartGit and GitKraken. I use the console almost exclusively now, but the GUIs are actually useful for newbies (I started out experimenting with GIT this way)",
    "githubSpeechBubbleText1": "The biggest git repository platform in the world. You can view my repositories and collaborations <a href='https://github.com/cesarblasco' target='_BLANK' rel='noreferrer noopener'>here</a>",
    "typescriptSpeechBubbleText1": "I learned typescript when I began developing apps in Angular 2 and it's the best thing I could've done. Nowdays typescript keeps growing and the type safety has definitely helped me prevent bugs, have more readable, mantainable code and a better development experience.",
    "prettierSpeechBubbleText1": "I love this tool, no more discusions on wether to use tabs or spaces, just let it run and fix it for you and your code will always be neat and tidy. I fully recommend it.",
    "underscoreSpeechBubbleText1": "Very useful libraries, you can save alot of time with them. I've worked with both already, lodash-es being the best version since it exports code as ES modules, reducing the bundle size",
    "esLintSpeechBubbleText1": "Another useful tool for declaring conventions in the code and making sure every developer follows them. It is quite handy to detect any issues when commiting code. I'm now familiar with the use and also recommend it.",
    "mySqlSpeechText1": "The first relational database management system I used and where I learned and applied the basics of the SQL language.",
    "bootstrapSpeechBubbleText1": "A very easy and useful CSS framework and the first one I used after learning CSS. I've worked with version 3 mostly but I have also used version 4. I like how easy it is to implement responsiveness and layout with it.",
    "scssModulesSpeechBubbleText1": "The best CSS preprocessor I've worked with so far. I like how it facilitates CSS development. In fact this portfolio uses SCSS that's compiled to CSS using a VS Code plugin called \"Live SASS compiler\".",
    "scssModulesSpeechBubbleText2": "When it comes to SCSS modules, I've worked with them recently and it really helps organize and truly separate CSS from each component. No more weird clashes between classes or weird bugs, I truly recommend it.",
    "jestSpeechBubbleText1": "Testing is important! I've been using Jest / Enzyme to test my angular / react components to have confidence in my code and add that extra layer of safety against bugs.",
    "jestSpeechBubbleText2": "I've done mostly unit tests and I believe code coverage should be high but realistic as well, 100% code coverage isn't easy or even necessary to achieve in my humble opinion.",
    "fontAwesomeBubbleText1": "Do you see the little animated icons? Those come from the font awesome icon library which I'm using on this website.",
    "resetSpeechBubbleTooltip": "Reset speech bubble to default message",
    "speechScrollTooltip": "Next message"
  },
  "projects": {
    "header": "My <span class='text-secondary'>projects</span>",
    "subHeader": "Check out my projects",
    "allProjectsCategory": "All",
    "webProjectsCategory": "Web",
    "mobileAppsCategory": "Mobile Apps",
    "gamesProjectsCategory": "Games",
    "otherProjectsCategory": "Others",
    "infoBtn": "Info",
    "githubBtn": "Github",
    "codepenBtn": "Codepen",
    "dentalClinic": "<i class='fas fa-tooth'></i></i> Dental Clinic <i class='fas fa-tooth'></i>",
    "dentalClinicAlt": "Dental Clinic",
    "githubSearch": "<i class='fab fa-github'></i> Github Search <i class='fab fa-github'></i>",
    "githubSearchAlt": "Github Search",
    "tributePage": "<i class='fas fa-book'></i> </i> Tribute Page  <i class='fas fa-book'></i>",
    "mathGame": "<i class='fas fa-gamepad'></i></i> LearnMaths <i class='fas fa-gamepad'></i>",
    "crypto": "<i class='fab fa-bitcoin'></i> Crypto compare <i class='fab fa-bitcoin'></i>",
    "cryptoAlt": "Crypto compare",
    "cryptoTitle": "Crypto compare",
    "cryptoDescription": "A React JS project to compare cryptocurrencies",
    "cryptoSummary": "A small project that allows you to compare all the cryptocurrencies you want. Compare them by price, market cap, supply or trading volume and compare them using 3 types of charts. The data comes from <a target='_blank' style='color: blue;' rel='noreferrer noopener' href='https://docs.coincap.io/?version=latest'>Coincap.io's API</a>",
    "battleCity": "<i class='fab fa-github'></i> Java Game <i class='fab fa-github'></i>",
    "cssLab": "<i class='fas fa-flask'></i> CSS Lab <i class='fas fa-flask'></i>",
    "cssLabAlt": "CSS Lab",
    "portfolio": "<i class='fas fa-suitcase'></i> Portfolio <i class='fas fa-suitcase'></i>",
    "portfolioAlt": "Portfolio",
    "technologiesUsed": "Technologies used:",
    "tryProject": "Live Demo",
    "dentalClinicTitle": "Dental Clinic",
    "dentalClinicDescription": "Dental clinic management web app",
    "dentalClinicSummary": "My largest application yet. This application handles the whole flow of work in a dental clinic. It features the following modules: appointments module, patient management, specialists (dentists) management, patient history, interactive teeth view, billing, PDF and Excel reports",
    "dentalClinicCaption1": "Login Screen",
    "dentalClinicCaption2": "Configuring an specialist (doctor) information, procedures and schedule",
    "dentalClinicCaption3": "Creating an appointment with that specialist for a patient by their identification number",
    "dentalClinicCaption4": "New appointment information and confirmation",
    "dentalClinicCaption5": "Success at new appointment creation for the selected day and time",
    "dentalClinicCaption6": "Editing / moving the appointment to another day and time",
    "dentalClinicCaption7": "Success at editing the appointment",
    "dentalClinicCaption8": "Specialist teeth module for the current patient (scrollable SVG per requested by the clinic)",
    "dentalClinicCaption9": "Adding some colors to certain sections of some tooths (represents a state of that part of the teeth)",
    "dentalClinicCaption10": "Adding certain procedures (represented by symbols or characters over each teeth)",
    "dentalClinicCaption11": "Adding a bridge (represented by a line connecting a series of teeths)",
    "dentalClinicCaption12": "Finish appointment modal, allows the specialist to create a list of procedures done to the patient's teeth and appointment type",
    "dentalClinicCaption13": "Mark appointment as finished modal, displays all procedures previously selected by the specialist and generates a receipt (in PDF) when accepted",
    "tributePageTitle": "Tribute page",
    "tributePageDescription": "A small bio page about Alan Turing",
    "tributePageSummary": "Part of the Free Code Camp challenges and frontend certificate",
    "tributePageCaption1": "Sample of the page",
    "cssLabTitle": "CSS Lab",
    "cssLabDescription": "A repository where I play around with CSS",
    "cssLabSummary": "Mini proyects where I apply CSS to create stuff like drawings or some basic layouts. No js, only html and CSS!",
    "cssLabCaption1": "Animated compass",
    "cssLabCaption2": "Cartoon building",
    "cssLabCaption3": "CSS Box model made in... CSS",
    "githubSearchTitle": "Github Search",
    "githubSearchDescription": "Angular JS app that uses Github's API to search for users and see repository details",
    "githubSearchSummary": "This project was the technical assessment sent to aspiring frontend developers for <a style='color: blue;' href='https://www.rankmi.com' target='blank' rel='noopener noreferrer'>Rankmi.com</a> which I passed and got accepted into the team.",
    "githubSearchCaption1": "Loading search from github user endpoint",
    "githubSearchCaption2": "Search results for Angular user",
    "githubSearchCaption3": "Selected repository detail",
    "githubSearchCaption4": "End of repository detail with back button",
    "mathGameTitle": "Learn Maths",
    "mathGameDescription": "A little game about basic math operations",
    "mathGameSummary": "A game I made while I was playing around with Unity 2D. Solve basic math problems and collect coins. You can get a sword if you have 10 coins by touching the golden treasures and use it with the spacebar",
    "mathGameCaption1": "Game start",
    "mathGameCaption2": "Chasing some coins",
    "mathGameCaption3": "Solve the problem and get more coins!",
    "mathGameCaption4": "Problem solved! You get paid based on the answer",
    "mathGameCaption5": "Just bought my sword with my hard earned money!",
    "mathGameCaption6": "Swing that master sword!",
    "cryptoCaption1": "Table with first 10 cryptos, nothing fancy yet, look at the next pics!",
    "cryptoCaption2": "A few cryptos selected and a little (made by me) toasty notification compared by price",
    "cryptoCaption3": "Same cryptos now compared by Market Cap",
    "cryptoCaption4": "Switched chart, now comparing with a Pie Chart",
    "cryptoCaption5": "Market Cap Pie Chart",
    "cryptoCaption6": "A new crypto added to the mix, all charts and values update automatically",
    "cryptoCaption7": "Multiple Bar Chart sample",
    "cryptoCaption8": "Multiple Bar Chart sample with horizontal layout",
    "cryptoCaption9": "Columns can be sorted. A tooltip also appears to let you know what that column's value means",
    "portfolioTitle": "Portfolio",
    "portfolioDescription": "The project you are currently on :)",
    "portfolioSummary": "I tried to use the least amount of dependencies as possible for this proyect by personal choice (Native JS without any frameworks and CSS generated via a VS code plugin using SASS). I also created a custom solution to handle translations between spanish and english easily and it's fully responsive, try it out on your mobile!",
    "portfolioCaption1": "Home",
    "portfolioCaption2": "About me (git skill selected, try clicking those skill pills for additional text)",
    "portfolioCaption3": "My projects",
    "portfolioCaption4": "Contact"
  },
  "contact": {
    "header": "Contact <span class='text-secondary'>me</span>",
    "subHeader": "This is how you can reach me",
    "name": "Name:",
    "namePlaceholder": "Your name",
    "email": "Email:",
    "emailPlaceholder": "Your email",
    "subject": "Subject:",
    "subjectPlaceholder": "Subject",
    "message": "Message:",
    "messagePlaceholder": "Your message...",
    "sendMessage": "Send"
  }
}
