{
  "navbar": {
    "home": "Home",
    "aboutMe": "Sobre mi",
    "projects": "Mis proyectos",
    "contact": "Contacto",
    "languages": "Idiomas"
  },
  "index": {
    "subHeader": "Ingeniero en computación, Desarrollador Web y Programador"
  },
  "about": {
    "header": "Sobre <span class='text-secondary'>mi</span>",
    "introductionLink": "Introducción",
    "technologiesLink": "Tecnologías",
    "experienceLink": "Experiencia",
    "coursesLink": "Cursos / Certificados",
    "technologiesTitle": "Tecnologias y habilidades",
    "allTechnologiesCategory": "Todas",
    "frontendTechnologiesCategory": "Frontend",
    "backendTechnologiesCategory": "Backend",
    "languagesTechnologiesCategory": "Lenguajes",
    "toolsTechnologiesCategory": "Herramientas",
    "experienceTitle": "Experiencia y educación",
    "resumeDownloadLink": "Puede descargar my CV <a target='_blank'  noreferrer noopener  href='/files/CesarBlascoResumeEsp.pdf'>aquí</a>",
    "timelineCategoryLine": "Linea de tiempo",
    "timelineCategoryStacked": "Cartas apiladas",
    "coursesTitle": "Cursos / certificados",
    "rankmiPosition": "Desarrollador Frontend (June 2018 - Actualidad)",
    "rankmiBullet1": "Desarrolle componentes, módulos y funcionalidades de diversas complejidades usando el framework Angular JS en su versión 1.6.7.",
    "rankmiBullet2": "Refactorize componentes de .js a .ts e hice mejoras a codigo legacy.",
    "rankmiBullet3": "Colabore en crear y refactorizar componentes para permitir accesibilidad por usuarios limitados o con discapacidades (Standares WAI ARIA para la web). Este sitio de portafolio es totalmente accesible.",
    "rankmiBullet4": "Aprendi React JS y colabore en la migracion de la aplicacion de AngularJS a React JS.",
    "sotecPosition": "Desarrollador Fullstack (June 2017 - June 2018)",
    "sotecBullet1": "Desarrolle componentes, modulos y funcionalidades usando el framework Angular versiones 2 a 5.",
    "sotecBullet2": "Colabore en desarrollo de una REST API usando Spring Framework y Entity Framework con Microsoft SQL Server.",
    "sotecBullet3": "Participe en proyectos utlizando la metodologia Scrum para desarollo agil.",
    "dentalClinicPosition": "Fullstack Developer (June 2016 - August 2017)",
    "dentalClinicBullet1": "Mi primera gran aplicación web que sirvió todas las funcionalidades de una clínica dental y el inicio de mi carrera hacia el desarrollo web. ",
    "dentalClinicBullet2": "Aunque no es realmente experiencia relacionada con un cargo o empleo, esta fue una app desarrollada para uso en el mundo real y lo considero una mención bastante valiosa en mi experiencia como desarrollador web.",
    "dentalClinicBullet3": "La aplicación posee los siguientes módulos: Citas, gestión de especialistas y procedimientos, CRUD de pacientes, historial de pacientes, interfaz interactiva de dentadura de los pacientes, reportes (PDF, Excel) y pagos.",
    "dentalClinicBullet4": "La interfaz que muestra la dentadura del paciente permite que el usuario muestre ciertas figuras y colorear cada sección de cada diente de forma individual.",
    "dentalClinicBullet5": "Herramientas usadas: Jquery, Laravel Framework, Bootstrap 3, SVG, Raphael JS, MySQL.",
    "defaultSpeechBubbleText1": "Hola! Mi nombre es César Blasco, soy un ingeniero de software que le importa el codigo limpio y las buenas practicas. Mi enfoque principal es el frontend y actualmente soy un desarrollador Angular transicionando a React. Tambien he hecho algo de backend con Java y frameworks PHP.",
    "defaultSpeechBubbleText2": "Me considero un jugador de equipo, siempre dispuesto a ayudar a los demas cuando se pueda, me ha tocado ser mentor y a su vez ser ensenado por otros con mas seniority que yo lo cual es una experiencia enriquecedora.",
    "defaultSpeechBubbleText3": "Al construir software soy analitico, metodico y oriento la arquitectura del software para brindar la mejor solucion posible.",
    "defaultSpeechBubbleText4": "<div class='text-center'>Algunos de mis hobbies favoritos son:</div> <ul class='centered-unordered-list'><li><i class='fas fa-tv'></i> Ver películas y series <i class='fas fa-tv'></i></li><li><i class='fas fa-laptop-code'></i> Programar <i class='fas fa-laptop-code'></i></li> <li><i class='fas fa-gamepad'></i> Videojuegos <i class='fas fa-gamepad'></i></li> <li><i class='fas fa-music'></i> Escuchar musica <i class='fas fa-music'></i></li> <li><i class='fas fa-walking'></i> Caminar <i class='fas fa-walking'></i></li><ul>",
    "htmlSpeechBubbleText1": "El esqueleto de la web",
    "cssSpeechBubbleText1": "La piel de la web, la capa de donde viene la belleza de la web. He trabajo con CSS tanto regular, frameworks y preprocesadores. Flexbox es mi patron de diseno css preferido por los momentos. Tambien he probado algo de grid. Este sitio web esta desarrollado mayoritariamente con flexbox y algo de grid",
    "jsSpeechBubbleText1": "Javascript ha ido mejorando ha medida que avanza el tiempo, actualmente me desenvuelvo con las funcionalidades de ES6+ lo cual me ha permitido escribir código mas eficiente y legible.<br> Deestructuring, arrow functions, const, let, map, filter y muchas mas ya las he aplicado en apps que han llegado a producción.",
    "reactSpeechBubbleText1": "He estado en transicion a React desde que la compania dodo.nde trabajo decidio migrar a este framework en vez de Angular y hasta el momento me ha encantado. Fue facil de entender una libreria tan pequena pero tan podersa. Definitiviamente me gusta el HTML en JS (JSX). Es mucho mas flexible y cualquier minimo typo sera detectado"
  },
  "projects": {
    "header": "Mis <span class='text-secondary'>proyectos</span>",
    "subHeader": "Revise mis proyectos",
    "allProjectsCategory": "Todos",
    "webProjectsCategory": "Web",
    "mobileAppsCategory": "Apps moviles",
    "gamesProjectsCategory": "Juegos",
    "otherProjectsCategory": "Otros",
    "infoBtn": "Información",
    "githubBtn": "Github",
    "codepenBtn": "Codepen"
  },
  "contact": {
    "header": "Vias de <span class='text-secondary'>contacto</span>",
    "subHeader": "Asi puede ponerse en contacto conmigo"
  }
}
