{
  "head": {
    "homeTitle": "Bienvenido a mi portafolio",
    "aboutTitle": "Sobre mi",
    "projectsTitle": "Mis proyectos",
    "contactTitle": "Contactame"
  },
  "navbar": {
    "home": "Home",
    "aboutMe": "Sobre mi",
    "projects": "Mis proyectos",
    "contact": "Contacto",
    "languages": "ES"
  },
  "index": {
    "subHeader": "Ingeniero en computación, Desarrollador Web y Programador"
  },
  "about": {
    "header": "Sobre <span class='text-secondary'>mi</span>",
    "technologiesLink": "Habilidades",
    "experienceLink": "Experiencia",
    "educationLink": "Educación",
    "coursesLink": "Certificados",
    "technologiesTitle": "<i class='fas fa-cog'></i> Habilidades <i class='fas fa-cog'></i>",
    "allTechnologiesCategory": "Todas",
    "frontendTechnologiesCategory": "Frontend",
    "backendTechnologiesCategory": "Backend",
    "languagesTechnologiesCategory": "Lenguajes",
    "toolsTechnologiesCategory": "Herramientas",
    "experienceTitle": "<i class='fa fa-book'></i> <i class='fas fa-book-open'></i> Experiencia <i class='fas fa-book-open'></i> <i class='fa fa-book'></i>",
    "educationTitle": "<i class='fas fa-graduation-cap'></i> Educación <i class='fas fa-graduation-cap'></i>",
    "educationPosition": "Ingeniero en Computación",
    "educationBullet1": "Obtuve mi titulo de pregrado como Ingeniero en Computación.",
    "educationBullet2": "Aprendí diversos temas relacionados a ingeniería y ciencias de la computación como Estructuras de Datos, Algoritmos, Programación Orientada a Objetos, etc.",
    "resumeDownloadLink": "Puede descargar my CV <a target='_blank'  rel='noreferrer noopener'  href='./files/CesarBlascoResumeEsp.pdf'>aquí</a>",
    "coursesTitle": "<i class='fas fa-chalkboard-teacher'></i> Certificados <i class='fas fa-chalkboard-teacher'></i>",
    "nearpodPosition": "Desarollador Full Stack (con enfoque en frontend) (Junio 2021 - Actualidad)",
    "nearpodBullet1": "<span class='bullet-link'><a href='https://nearpod.com/' target='_BLANK'>Nearpod.com</a></span> (siendo parte de empresas de <span class='bullet-link'><a href='https://www.renaissance.com/about-us/' target='_BLANK'>Renaissance</a></span> un líder global en plataformas y tecnologías educativas para estudiantes de educación inicial / pre-K12) fue mi primera experiencia con miembros de equipo en los Estados Unidos y comunicación constante en ingles incluyendo dailies, plannings etc siguiendo la metodología scrum con sprints de 2 semanas.",
    "nearpodBullet2": "Participe y lidere investigación (spikes) para implementar dos nuevos microfrontends para los profesores de la aplicación, lo que agrego valor a más de un millón de profesores.",
    "nearpodBullet3": "Construí componentes reusables esenciales a ser usados por toda la empresa mediante colaboraciones a la librería de componentes de la empresa",
    "nearpodBullet4": "Trabaje en un backend PHP con las herramientas internas de la empresa y pruebas unitarias lo cual me permitió tomar tareas relacionadas a backend aunque mi rol era primariamente de frontend.",
    "rankmiPosition": "Desarrollador Frontend (Junio 2018 - Junio 2021)",
    "rankmiBullet1": "Desarrollé componentes, módulos y funcionalidades de diversas complejidades usando el framework Angular JS en su versión 1.6.7.",
    "rankmiBullet2": "Refactorize componentes de .js a .ts e hice mejoras a codigo legacy.",
    "rankmiBullet3": "Colaboré en crear y refactorizar componentes para permitir accesibilidad por usuarios limitados o con discapacidades (Estandares WAI ARIA para la web).",
    "rankmiBullet4": "Aprendí React JS y colaboré en la migración de la aplicación de AngularJS a React JS.",
    "sotecPosition": "Desarrollador Fullstack (Junio 2017 - Junio 2018)",
    "sotecBullet1": "Desarrollé componentes, módulos y funcionalidades usando el framework Angular versiones 2 a 5.",
    "sotecBullet2": "Colaboré en desarrollo de REST APIs usando Spring Framework y Entity Framework con Microsoft SQL Server.",
    "sotecBullet3": "Participé en proyectos utilizando la metodología Scrum para desarrollo ágil.",
    "dentalClinicPosition": "Desarollador Fullstack (Junio 2016 - Agosto 2017)",
    "dentalClinicBullet1": "Mi primera gran aplicación web que sirvió todas las funcionalidades de una clínica dental y el inicio de mi carrera hacia el desarrollo web. ",
    "dentalClinicBullet2": "Aunque no es realmente experiencia relacionada con un cargo o empleo, esta fue una app desarrollada para uso en el mundo real y lo considero una mención bastante valiosa en mi experiencia como desarrollador web.",
    "dentalClinicBullet3": "La aplicación posee los siguientes módulos: Citas, gestión de especialistas y procedimientos, CRUD de pacientes, historial de pacientes, interfaz interactiva de dentadura de los pacientes, reportes (PDF, Excel) y pagos.",
    "dentalClinicBullet4": "La interfaz que muestra la dentadura del paciente permite que el usuario muestre ciertas figuras y colorear cada sección de cada diente de forma individual.",
    "dentalClinicBullet5": "Herramientas usadas: Jquery, Laravel Framework, Bootstrap 3, SVG, Raphael JS, MySQL.",
    "defaultSpeechBubbleText1": "¡Hola! Mi nombre es César Blasco, soy un Ingeniero de Software Senior que le interesa el código limpio y las buenas prácticas. Mi enfoque principal actualmente es el frontend y soy un desarrollador con React. También he desarrollado en el pasado con Angular 1 y 2+ y también algo de backend con Java y frameworks PHP.",
    "defaultSpeechBubbleText2": "Me considero un jugador de equipo, siempre dispuesto a ayudar a los demas cuando se pueda, me ha tocado ser mentor y a su vez ser ensenado por otros con mas seniority que yo lo cual es una experiencia enriquecedora.",
    "defaultSpeechBubbleText3": "Al construir software soy analítico, metódico y oriento la arquitectura del software para brindar la mejor solución posible.",
    "defaultSpeechBubbleText4": "<div class='text-center'>Algunos de mis hobbies favoritos son:</div> <ul class='centered-unordered-list'><li><i class='fas fa-tv'></i> Ver películas y series <i class='fas fa-tv'></i></li><li><i class='fas fa-laptop-code'></i> Programar <i class='fas fa-laptop-code'></i></li> <li><i class='fas fa-gamepad'></i> Videojuegos <i class='fas fa-gamepad'></i></li> <li><i class='fas fa-music'></i> Escuchar musica <i class='fas fa-music'></i></li> <li><i class='fas fa-walking'></i> Caminar <i class='fas fa-walking'></i></li><ul>",
    "htmlSpeechBubbleText1": "El esqueleto de la web, define la estructura básica de las paginas web. Actualmente se tiende a escribir HTML dependiendo del framework / librería usado. Ya sea HTML en JS (JSX / React), JS en HTML (directivas / angular). La accesibilidad y el HTML semántico son también otros conceptos importantes.",
    "cssSpeechBubbleText1": "La piel de la web, la capa de donde viene la belleza de la web. He trabajo con CSS tanto regular, frameworks y preprocesadores. Flexbox es de mi preferencia por los momentos. También he probado algo de grid. Este sitio web esta desarrollado mayoritariamente con flexbox y algo de grid",
    "jsSpeechBubbleText1": "Javascript ha ido mejorando ha medida que avanza el tiempo, actualmente me desenvuelvo con las funcionalidades de ES6+ lo cual me ha permitido escribir código mas eficiente y legible.<br> Deestructuring, arrow functions, const, let, map, filter y muchas mas ya las he aplicado en apps que han llegado a producción.",
    "jsSpeechBubbleText2": "Puede ver como lo aplico funcionalidades de ES6+ tambien en el codigo fuente de este portafolio. En otra nota, no use un framework para el desarrollo de este, lo considere excesivo asi que solo encontrara vanilla JS.",
    "reactSpeechBubbleText1": "Desde que probe react me ha encantado, tanto asi que decidi dedicarme por completo a esta libreria. El API es bastante pequeño pero muy poderoso. Combinalo con JSX y TS (TSX el cual es el que he trabajado desde que aprendi la libreria) y cualquier minimo \"typo\" sera detectado.",
    "jquerySpeechBubbleText1": "Una de las primeras librerías javascript que aprendí. Aunque actualmente el mundo esta dejando atrás esta librería, me pareció bastante fácil de entender e incluso aprender mas manipulación del DOM con ella.",
    "phpSpeechBubbleText1": "Aprendí por mi cuenta mientras estaba en la universidad y despues aprendí el framework Laravel (un framework PHP) en el cual desarrolle mi aplicación web de clínica odontológica. No he desarrollador en PHP desde hace un tiempo ya que me he quedado con las librerías y frameworks JS, pero aun tengo el conocimiento.",
    "vsCodeSpeechBubbleText1": "Mi editor de código favorito. Es tan simple pero tan poderoso, una cantidad infinita de plugins y una comunidad gigantesca respaldandolo. De hecho yo empecé con Sublime Text cuando empecé a aprender desarrollo web pero ahora no puedo devolverme :)",
    "vsCodeSpeechBubbleText2": "Algunos de mis plugins favoritos son: Live Server, Live Sass Compiler, Prettier, Bracket Pair Colorizer, Git Lens y algunos otros.",
    "angularSpeechBubbleText1": "Angular fue el primer framework frontend que aprendí. Complete cursos, me entrene y conseguí mi primer trabajo usando este poderoso framework. Al principio fue difícil ya que hay demasiados conceptos que aprender, pero una vez dominados te das cuenta que puedes desarrollar lo que sea y ya viene todo incluido.",
    "angularjsSpeechBubbleText1": "Aprendí Angular JS cuando me cambie de trabajo. La transición no fue tan difícil como pensé que seria ya que la versión que usaba la empresa era la 1.6.7 la cual usaba el modelo orientado a componentes similar a angular 2+.",
    "laravelSpeechBubbleText1": "El primer framework de desarrollo web que aprendí y use. Estaba en la universidad cuando escuche de este framework y decidí probarlo. Es bastante bueno y es tan fácil de desarrollar apps con el. Desarrolle mi aplicación de clínica dental usando este framework y salio bastante bien.",
    "gitSpeechBubbleText1": "<span class=\"console-user\">blasco@cesar-pc:</span> <span class=\"console-directory\">~/i18n/en</span> <br> $ git commit -m \"Acerca de git\" -m \"Actualizar nube de dialogo con informacion acerca del mejor sistema de control de versiones, agregar key al JSON\" <br><br> <span class=\"console-user\">blasco@cesar-pc:</span> <span class=\"console-directory\">~/i18n/en</span> <br> $ git push",
    "gitSpeechBubbleText2": "He usado git en consola y en clientes GUI como SmartGit y GitKraken. Ahora uso casi exclusivamente la consola pero las GUIs son muy buenas para novatos (De hecho empecé experimentando con Git de esta manera).",
    "githubSpeechBubbleText1": "La plataforma de repositorios git mas grande del mundo. Puede encontrar mis repositorios y colaboraciones <a href='https://github.com/cesarblasco' target='_BLANK'extraño rel='noreferrer noopener'>aqui</a>",
    "typescriptSpeechBubbleText1": "Aprendí typescript cuando empecé a desarrollar apps en Angular 2 y es una de las mejores cosas que pude hacer. Actualmente typescript sigue creciendo y el tipado estático me ha ayudado a prevenir errores, tener un código mas legible y mantenible y una mejor experiencia de desarrollo.",
    "prettierSpeechBubbleText1": "Me encanta esta herramienta, ya no hay discusiones sobre si usar tabs o espacios en el código, solo deja que lo arregle y siempre tendrás un código ordenado y formateado, lo recomiendo al 100%.",
    "underscoreSpeechBubbleText1": "Librerias muy utiles, puedes ahorrar mucho tiempo con ellas. Ya he usado ambas y lodash-es me parece la mejor ya que exporta su codigo a traves de modulos ES, reduciendo el tamaño del bundle.",
    "esLintSpeechBubbleText1": "Otra herramienta útil para declarar convenciones en el código y asegurar que cada desarrollador las siga. Es muy útil para detectar cualquier inconveniente a la hora de subir código. Ya esto familiarizado con su uso y también lo recomiendo.",
    "mySqlSpeechText1": "El primer sistema de base de datos relacional que use y en el cual aprendi y aplique mis conocimientos basicos de SQL.",
    "bootstrapSpeechBubbleText1": "Un framework CSS muy fácil y útil y la primera que utilice despues de aprender CSS. He trabajado mas que todo con la versión 3 pero también he usado la versión 4. Me gusta lo fácil que es implementar maquetación y responsive con este.",
    "scssModulesSpeechBubbleText1": "El mejor preprocesador CSS con el que he trabajado hasta los momentos. Me gusta como facilita el desarrollo de CSS. De hecho este portafolio usa SCSS que es compilado a CSS usando un plugin de VS Code llamado \"Live SASS compiler\".",
    "scssModulesSpeechBubbleText2": "En lo que respecta a los módulos SCSS, he trabajado con ellos recientemente y realmente ayuda a organizar y realmente separar el CSS de cada componente. Esto evita conflictos extraños entre clases o errores de CSS.",
    "jestSpeechBubbleText1": "Hacer pruebas es importante. He estado usando Jest / Enzyme para realizar pruebas a mis componentes Angular / React y tener confianza en el código que escribo, agregando esa capa adicional de seguridad contra bugs.",
    "jestSpeechBubbleText2": "He hecho pruebas unitarias mas que todo y creo que la amplitud o \"coverage\" de las pruebas del código deberían ser altas pero no irreales. Un 100% de coverage no es fácil e incluso es innecesario en mi humilde opinión.",
    "fontAwesomeBubbleText1": "¿Ves los iconos animados? Esos vienen de la librería de iconos Font Awesome la cual estoy usando en esta pagina.",
    "visXChartsBubbleText1": "Esta librería de AirBNB  fue usada cuando estaba trabajando en un proyecto microfrontend en Nearpod. Su versatilidad y personalización a bajo nivel vía elementos SVG como y fueron muy importantes a la hora de trabajar en ese proyecto.",
    "reduxSpeechBubbleText1": "Redux una de las mas conocida si no la mas conocida solution de manejo de estados si bien es un poco compleja definitivamente ayuda a escalar aplicaciones de gran amplitud, si se usa la redux dev tools se hace la vida mas facil para rastrear y debugear actions y actualizaciones de estado en la app.",
    "resetSpeechBubbleTooltip": "Reiniciar dialogo al mensaje por defecto",
    "speechScrollTooltip": "Próximo mensaje"
  },
  "projects": {
    "header": "Mis <span class='text-secondary'>proyectos</span>",
    "subHeader": "Revise mis proyectos",
    "allProjectsCategory": "Todos",
    "webProjectsCategory": "Web",
    "mobileAppsCategory": "Apps moviles",
    "gamesProjectsCategory": "Juegos",
    "otherProjectsCategory": "Otros",
    "infoBtn": "Información",
    "githubBtn": "Github",
    "codepenBtn": "Codepen",
    "dentalClinic": "<i class='fas fa-tooth'></i></i> Clinica Dental <i class='fas fa-tooth'></i>",
    "dentalClinicAlt": "Clinica Dental",
    "githubSearch": "<i class='fab fa-github'></i> Buscador Github <i class='fab fa-github'></i>",
    "githubSearchAlt": "Buscador Github",
    "tributePage": "<i class='fas fa-book'></i> </i> Tributo <i class='fas fa-book'></i>",
    "mathGame": "<i class='fas fa-gamepad'></i></i> LearnMaths <i class='fas fa-gamepad'></i>",
    "crypto": "<i class='fab fa-bitcoin'></i> Comparador de criptos <i class='fab fa-bitcoin'></i>",
    "cryptoAlt": "Comparador de criptos",
    "cryptoTitle": "Comparador de criptos",
    "cryptoDescription": "Un proyecto hecho en React JS para comparar criptomonedas",
    "cryptoSummary": "Un pequeño proyecto que te permite comparar todas las criptomonedas que quieras. Puedes compararlas por precio, capitalización de mercado, suministro o volumen de intercambio y además compararlas usando 3 tipos de gráficos disponibles. La data llega desde la <a target='_blank' style='color: blue;' target='_BLANK'  rel='noreferrer noopener' href='https://docs.coincap.io/?version=latest'>API de coincap.io</a>",
    "battleCity": "<i class='fab fa-github'></i> Java Game <i class='fab fa-github'></i>",
    "cssLab": "<i class='fas fa-flask'></i> Laboratorio CSS <i class='fas fa-flask'></i>",
    "cssLabAlt": "Laboratorio CSS",
    "portfolio": "<i class='fas fa-suitcase'></i> Portafolio <i class='fas fa-suitcase'></i>",
    "portfolioAlt": "Portafolio",
    "technologiesUsed": "Tecnologías usadas:",
    "tryProject": "Demo en vivo",
    "dentalClinicTitle": "Clínica dental",
    "dentalClinicDescription": "Aplicación web de administración de una clínica odontológica",
    "dentalClinicSummary": "Mi mas grande aplicación hasta la fecha. Esta aplicación maneja todo el flujo de trabajo en una clínica dental. Consiste en los siguientes módulos: modulo de citas, administración de pacientes, administración de especialistas (dentistas), historial de pacientes, vista interactiva de dentadura, pagos y reportes PDF y Excel",
    "dentalClinicCaption1": "Vista de login",
    "dentalClinicCaption2": "Configurando la información, procedimientos y horario de un especialista (doctor)",
    "dentalClinicCaption3": "Creando una cita con ese especialista para un paciente por su numero de identificación",
    "dentalClinicCaption4": "Información de nueva cita y confirmación",
    "dentalClinicCaption5": "Éxito al crear la nueva cita para el día y hora seleccionados",
    "dentalClinicCaption6": "Editando / moviendo la cita a otro día y hora",
    "dentalClinicCaption7": "Éxito al editar la cita",
    "dentalClinicCaption8": "Modulo de dentadura del especialista para el paciente actual (SVG con scroll debido a petición de la clínica)",
    "dentalClinicCaption9": "Agregando colores a algunas secciones de algunos dientes (representa el estado de esa sección de ese diente)",
    "dentalClinicCaption10": "Agregando algunos procedimientos (representados por símbolos o caracteres sobre cada diente)",
    "dentalClinicCaption11": "Agregando un puente (representado por una linea que conecta una serie de dientes)",
    "dentalClinicCaption12": "Modal o dialogo de finalizacion de cita, permite al especialista crear una lista de procedimientos realizados al paciente y definir el tipo de cita",
    "dentalClinicCaption13": "Modal o cuadro de dialogo para marcar cita como terminada, muestra todos los procedimientos realizados previamente por el especialista y genera un recibo (en PDF) cuando es aceptado.",
    "tributePageTitle": "Pagina de tributo",
    "tributePageDescription": "Una pequeña pagina biográfica de Alan Turing",
    "tributePageSummary": "Parte de los retos de Free Code Camp para obtener el certificado de frontend",
    "tributePageCaption1": "Muestra de la pagina",
    "cssLabTitle": "Laboratorio CSS",
    "cssLabDescription": "Un repositorio en donde juego con CSS",
    "cssLabSummary": "Mini proyectos donde creo cosas como dibujos u otro tipo de pruebas. ¡Los dibujos solo usan HTML y CSS sin JS!",
    "cssLabCaption1": "Compas animado",
    "cssLabCaption2": "Edificio de caricatura",
    "cssLabCaption3": "Modelo de caja CSS hecha en... CSS",
    "cssLabCaption4": "Drag and Drop multiple como en Gmail",
    "githubSearchTitle": "Busqueda de Github",
    "githubSearchDescription": "Proyecto hecho en Angular JS que usa el API de Github para buscar usuarios y ver detalles de sus repositorios",
    "githubSearchSummary": "Este proyecto fue la prueba tecnica enviada a aspirantes al cargo de desarrollador frontend para <a style='color: blue;' href='https://www.rankmi.com' target='_BLANK' rel='noreferrer noopener'>Rankmi.com</a> el cual pase y fui aceptado en el equipo`",
    "githubSearchCaption1": "Endpoint de busqueda de usuarios en progreso",
    "githubSearchCaption2": "Resultados de busqueda para el usuario Angular",
    "githubSearchCaption3": "Detalle del repositorio seleccionado",
    "githubSearchCaption4": "Fin de detalle de repositorio con boton volver",
    "mathGameTitle": "Learn Maths",
    "mathGameDescription": "Un mini juego de operaciones básicas de matemáticas",
    "mathGameSummary": "Un juego que hice hace unos anos atras mientras experimentaba con Unity 2D. Resuelve operaciones matematicas basicas  y obten monedas. Puedes comprar una espada si tienes 10 monedas tocando los tesoros dorados y la puedes usar con la barra espaciadora.",
    "mathGameCaption1": "Comienzo del juego",
    "mathGameCaption2": "Corriendo hacia algunas monedas",
    "mathGameCaption3": "Resuelve el probelma y obten mas monedas!Solve the problem and get more coins!",
    "mathGameCaption4": "Problema resuelto! Eres pagado basado en la respuestaProblem solved! You get paid based on the answer",
    "mathGameCaption5": "Acabo de comprar mi espada con mi dinero ganado con mucho esfuerzo!",
    "mathGameCaption6": "Usa esa espada maestra!",
    "cryptoCaption1": "Tabla con primeras 10 cryptos, no es gran cosa aun, ve las proximas capturas",
    "cryptoCaption2": "Algunas criptos seleccionadas, comparadas por precio y una notificacion tipo toasty hecha por mi mismo",
    "cryptoCaption3": "Las mismas criptomonedas ahora comparadas por Capitalizacion de Mercado",
    "cryptoCaption4": "Cambio a otro chart, ahora comparando con un grafico de torta",
    "cryptoCaption5": "Grafico de torta de capitalizacion de mercado",
    "cryptoCaption6": "Se he agregado una nueva critpomoneda, todos los graficos y valores se actualizan automaticamente",
    "cryptoCaption7": "Ejemplo con la grafica multiples barras",
    "cryptoCaption8": "Ejemplo con la grafica de multiples barras con layout horizontal",
    "cryptoCaption9": "Las columnas pueden ser ordenadas. Un tooltip tambien aparece para dejarte saber que significa cada valor",
    "portfolioTitle": "Portafolio",
    "portfolioDescription": "El proyecto en el que estas actualmente :)",
    "portfolioSummary": "Intente usar la menor cantidad de recursos o dependencias externas por decisión propia (JS nativo sin framework y CSS generado por un plugin de VS Code que usa SASS). La unica dependencia externa es el paquete de iconos Font Awesome. También cree una solucion personalizada para manejar las traducciones entre español e ingles, además es full responsive ¡prueba la pagina en tu dispositivo móvil!",
    "portfolioCaption1": "Home",
    "portfolioCaption2": "Sobre mi (habilidad Git seleccionada, intenta hacer click en las habilidades para ver mas texto)",
    "portfolioCaption3": "Mis proyectos",
    "portfolioCaption4": "Contacto"
  },
  "contact": {
    "header": "Medios de <span class='text-secondary'>contacto</span>",
    "subHeader": "Asi se puede poner en contacto conmigo",
    "name": "Nombre:",
    "namePlaceholder": "Su nombre",
    "email": "Email:",
    "emailPlaceholder": "Su correo",
    "subject": "Asunto:",
    "subjectPlaceholder": "Motivo de contacto",
    "message": "Mensaje:",
    "messagePlaceholder": "Su mensaje...",
    "sendMessage": "Enviar"
  }
}
